Revit 2027 API
ExtrusionAnalyzer.CalculateFaceAlignment Method
 Calculates the alignment status of each face of the solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<Face, ExtrusionAnalyzerFaceAlignment> CalculateFaceAlignment()
Public Function CalculateFaceAlignment As IDictionary(Of Face, ExtrusionAnalyzerFaceAlignment)
public:
IDictionary<Face^, ExtrusionAnalyzerFaceAlignment>^ CalculateFaceAlignment()
member CalculateFaceAlignment : unit -> IDictionary<Face, ExtrusionAnalyzerFaceAlignment>
Return Value
IDictionary<Face, ExtrusionAnalyzerFaceAlignment>
 Maps each face of the solid to its alignment status.
Remarks
 You can obtain the element which produced the non-aligned face by passing the face to Element.GetGeneratingElementIds().
See Also
Reference
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace